# Orders_3NF
In **3NF**, we remove transitive dependency.

### Problems in 2NF:
- Product price repeated in every OrderDetails row.
- If product price changes, multiple rows must be updated.

### Fix in 3NF:
- Create separate `Products` table with `ProductID` and `UnitPrice`.
- `OrderDetails` now references `ProductID` instead of storing price repeatedly.

In [ ]:
DROP TABLE Customers;

In [ ]:
CREATE TABLE Customers (
    CustomerID NUMBER PRIMARY KEY,
    CustomerName VARCHAR2(50),
    Address VARCHAR2(100)
);

In [ ]:
INSERT ALL
  INTO Customers VALUES (1, 'Arjun Sharma', 'Bengaluru')
  INTO Customers VALUES (2, 'Priya Nair', 'Chennai')
  INTO Customers VALUES (3, 'Ramesh Iyer', 'Hyderabad')
  INTO Customers VALUES (4, 'Kavita Desai', 'Mumbai')
  INTO Customers VALUES (5, 'Meena Joshi', 'Pune')
  INTO Customers VALUES (6, 'Suresh Reddy', 'Delhi')
  INTO Customers VALUES (7, 'Ananya Rao', 'Kolkata')
  INTO Customers VALUES (8, 'Rajesh Gupta', 'Jaipur')
  INTO Customers VALUES (9, 'Neha Kulkarni', 'Ahmedabad')
  INTO Customers VALUES (10, 'Manoj Verma', 'Lucknow')
SELECT * FROM dual;

In [ ]:
SELECT * FROM Customers;

In [ ]:
DROP TABLE Orders;

In [ ]:
CREATE TABLE Orders (
    OrderID NUMBER PRIMARY KEY,
    CustomerID NUMBER,
    OrderDate DATE
);

In [ ]:
INSERT ALL
  INTO Orders VALUES (1, 1, TO_DATE('2025-01-2','YYYY-MM-DD'))
  INTO Orders VALUES (2, 2, TO_DATE('2025-01-3','YYYY-MM-DD'))
  INTO Orders VALUES (3, 3, TO_DATE('2025-01-4','YYYY-MM-DD'))
  INTO Orders VALUES (4, 4, TO_DATE('2025-01-5','YYYY-MM-DD'))
  INTO Orders VALUES (5, 5, TO_DATE('2025-01-6','YYYY-MM-DD'))
  INTO Orders VALUES (6, 6, TO_DATE('2025-01-7','YYYY-MM-DD'))
  INTO Orders VALUES (7, 7, TO_DATE('2025-01-8','YYYY-MM-DD'))
  INTO Orders VALUES (8, 8, TO_DATE('2025-01-9','YYYY-MM-DD'))
  INTO Orders VALUES (9, 9, TO_DATE('2025-01-10','YYYY-MM-DD'))
  INTO Orders VALUES (10, 10, TO_DATE('2025-01-11','YYYY-MM-DD'))
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders VALUES (11, 1, TO_DATE('2025-01-12','YYYY-MM-DD'))
  INTO Orders VALUES (12, 2, TO_DATE('2025-01-13','YYYY-MM-DD'))
  INTO Orders VALUES (13, 3, TO_DATE('2025-01-14','YYYY-MM-DD'))
  INTO Orders VALUES (14, 4, TO_DATE('2025-01-15','YYYY-MM-DD'))
  INTO Orders VALUES (15, 5, TO_DATE('2025-01-16','YYYY-MM-DD'))
  INTO Orders VALUES (16, 6, TO_DATE('2025-01-17','YYYY-MM-DD'))
  INTO Orders VALUES (17, 7, TO_DATE('2025-01-18','YYYY-MM-DD'))
  INTO Orders VALUES (18, 8, TO_DATE('2025-01-19','YYYY-MM-DD'))
  INTO Orders VALUES (19, 9, TO_DATE('2025-01-20','YYYY-MM-DD'))
  INTO Orders VALUES (20, 10, TO_DATE('2025-01-21','YYYY-MM-DD'))
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders VALUES (21, 1, TO_DATE('2025-01-22','YYYY-MM-DD'))
  INTO Orders VALUES (22, 2, TO_DATE('2025-01-23','YYYY-MM-DD'))
  INTO Orders VALUES (23, 3, TO_DATE('2025-01-24','YYYY-MM-DD'))
  INTO Orders VALUES (24, 4, TO_DATE('2025-01-25','YYYY-MM-DD'))
  INTO Orders VALUES (25, 5, TO_DATE('2025-01-26','YYYY-MM-DD'))
  INTO Orders VALUES (26, 6, TO_DATE('2025-01-27','YYYY-MM-DD'))
  INTO Orders VALUES (27, 7, TO_DATE('2025-01-28','YYYY-MM-DD'))
  INTO Orders VALUES (28, 8, TO_DATE('2025-01-1','YYYY-MM-DD'))
  INTO Orders VALUES (29, 9, TO_DATE('2025-01-2','YYYY-MM-DD'))
  INTO Orders VALUES (30, 10, TO_DATE('2025-01-3','YYYY-MM-DD'))
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders VALUES (31, 1, TO_DATE('2025-01-4','YYYY-MM-DD'))
  INTO Orders VALUES (32, 2, TO_DATE('2025-01-5','YYYY-MM-DD'))
  INTO Orders VALUES (33, 3, TO_DATE('2025-01-6','YYYY-MM-DD'))
  INTO Orders VALUES (34, 4, TO_DATE('2025-01-7','YYYY-MM-DD'))
  INTO Orders VALUES (35, 5, TO_DATE('2025-01-8','YYYY-MM-DD'))
  INTO Orders VALUES (36, 6, TO_DATE('2025-01-9','YYYY-MM-DD'))
  INTO Orders VALUES (37, 7, TO_DATE('2025-01-10','YYYY-MM-DD'))
  INTO Orders VALUES (38, 8, TO_DATE('2025-01-11','YYYY-MM-DD'))
  INTO Orders VALUES (39, 9, TO_DATE('2025-01-12','YYYY-MM-DD'))
  INTO Orders VALUES (40, 10, TO_DATE('2025-01-13','YYYY-MM-DD'))
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO Orders VALUES (41, 1, TO_DATE('2025-01-14','YYYY-MM-DD'))
  INTO Orders VALUES (42, 2, TO_DATE('2025-01-15','YYYY-MM-DD'))
  INTO Orders VALUES (43, 3, TO_DATE('2025-01-16','YYYY-MM-DD'))
  INTO Orders VALUES (44, 4, TO_DATE('2025-01-17','YYYY-MM-DD'))
  INTO Orders VALUES (45, 5, TO_DATE('2025-01-18','YYYY-MM-DD'))
  INTO Orders VALUES (46, 6, TO_DATE('2025-01-19','YYYY-MM-DD'))
  INTO Orders VALUES (47, 7, TO_DATE('2025-01-20','YYYY-MM-DD'))
  INTO Orders VALUES (48, 8, TO_DATE('2025-01-21','YYYY-MM-DD'))
  INTO Orders VALUES (49, 9, TO_DATE('2025-01-22','YYYY-MM-DD'))
  INTO Orders VALUES (50, 10, TO_DATE('2025-01-23','YYYY-MM-DD'))
SELECT * FROM dual;

In [ ]:
SELECT * FROM Orders;

In [ ]:
DROP TABLE Products;

In [ ]:
CREATE TABLE Products (
    ProductID NUMBER PRIMARY KEY,
    ProductName VARCHAR2(50),
    UnitPrice NUMBER
);

In [ ]:
INSERT ALL
  INTO Products VALUES (1, 'Laptop', 800)
  INTO Products VALUES (2, 'Mouse', 200)
  INTO Products VALUES (3, 'Rice', 500)
  INTO Products VALUES (4, 'Oil', 300)
  INTO Products VALUES (5, 'Sugar', 250)
  INTO Products VALUES (6, 'Mobile', 700)
  INTO Products VALUES (7, 'Charger', 150)
  INTO Products VALUES (8, 'Mixer', 400)
  INTO Products VALUES (9, 'Grinder', 300)
  INTO Products VALUES (10, 'TV', 1500)
  INTO Products VALUES (11, 'Remote', 200)
  INTO Products VALUES (12, 'Chair', 600)
  INTO Products VALUES (13, 'Table', 800)
  INTO Products VALUES (14, 'Pen', 20)
  INTO Products VALUES (15, 'Notebook', 50)
  INTO Products VALUES (16, 'Bag', 200)
  INTO Products VALUES (17, 'Shoes', 900)
  INTO Products VALUES (18, 'Socks', 100)
  INTO Products VALUES (19, 'Watch', 1200)
  INTO Products VALUES (20, 'Earphones', 400)
  INTO Products VALUES (21, 'Fan', 1000)
  INTO Products VALUES (22, 'Cooler', 2500)
SELECT * FROM dual;

In [ ]:
SELECT * FROM Products;

In [ ]:
DROP TABLE OrderDetails;

In [ ]:
CREATE TABLE OrderDetails (
    OrderID NUMBER,
    ProductID NUMBER,
    Quantity NUMBER
);

In [ ]:
INSERT ALL
  INTO OrderDetails VALUES (1, 1, 1)
  INTO OrderDetails VALUES (1, 2, 1)
  INTO OrderDetails VALUES (2, 3, 1)
  INTO OrderDetails VALUES (2, 4, 1)
  INTO OrderDetails VALUES (2, 5, 1)
  INTO OrderDetails VALUES (3, 6, 1)
  INTO OrderDetails VALUES (3, 7, 1)
  INTO OrderDetails VALUES (4, 8, 1)
  INTO OrderDetails VALUES (4, 9, 1)
  INTO OrderDetails VALUES (5, 10, 1)
  INTO OrderDetails VALUES (5, 11, 1)
  INTO OrderDetails VALUES (6, 12, 1)
  INTO OrderDetails VALUES (6, 13, 1)
  INTO OrderDetails VALUES (7, 14, 1)
  INTO OrderDetails VALUES (7, 15, 1)
  INTO OrderDetails VALUES (7, 16, 1)
  INTO OrderDetails VALUES (8, 17, 1)
  INTO OrderDetails VALUES (8, 18, 1)
  INTO OrderDetails VALUES (9, 19, 1)
  INTO OrderDetails VALUES (9, 20, 1)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO OrderDetails VALUES (10, 21, 1)
  INTO OrderDetails VALUES (10, 22, 1)
  INTO OrderDetails VALUES (11, 1, 1)
  INTO OrderDetails VALUES (11, 2, 1)
  INTO OrderDetails VALUES (12, 3, 1)
  INTO OrderDetails VALUES (12, 4, 1)
  INTO OrderDetails VALUES (12, 5, 1)
  INTO OrderDetails VALUES (13, 6, 1)
  INTO OrderDetails VALUES (13, 7, 1)
  INTO OrderDetails VALUES (14, 8, 1)
  INTO OrderDetails VALUES (14, 9, 1)
  INTO OrderDetails VALUES (15, 10, 1)
  INTO OrderDetails VALUES (15, 11, 1)
  INTO OrderDetails VALUES (16, 12, 1)
  INTO OrderDetails VALUES (16, 13, 1)
  INTO OrderDetails VALUES (17, 14, 1)
  INTO OrderDetails VALUES (17, 15, 1)
  INTO OrderDetails VALUES (17, 16, 1)
  INTO OrderDetails VALUES (18, 17, 1)
  INTO OrderDetails VALUES (18, 18, 1)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO OrderDetails VALUES (19, 19, 1)
  INTO OrderDetails VALUES (19, 20, 1)
  INTO OrderDetails VALUES (20, 21, 1)
  INTO OrderDetails VALUES (20, 22, 1)
  INTO OrderDetails VALUES (21, 1, 1)
  INTO OrderDetails VALUES (21, 2, 1)
  INTO OrderDetails VALUES (22, 3, 1)
  INTO OrderDetails VALUES (22, 4, 1)
  INTO OrderDetails VALUES (22, 5, 1)
  INTO OrderDetails VALUES (23, 6, 1)
  INTO OrderDetails VALUES (23, 7, 1)
  INTO OrderDetails VALUES (24, 8, 1)
  INTO OrderDetails VALUES (24, 9, 1)
  INTO OrderDetails VALUES (25, 10, 1)
  INTO OrderDetails VALUES (25, 11, 1)
  INTO OrderDetails VALUES (26, 12, 1)
  INTO OrderDetails VALUES (26, 13, 1)
  INTO OrderDetails VALUES (27, 14, 1)
  INTO OrderDetails VALUES (27, 15, 1)
  INTO OrderDetails VALUES (27, 16, 1)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO OrderDetails VALUES (28, 17, 1)
  INTO OrderDetails VALUES (28, 18, 1)
  INTO OrderDetails VALUES (29, 19, 1)
  INTO OrderDetails VALUES (29, 20, 1)
  INTO OrderDetails VALUES (30, 21, 1)
  INTO OrderDetails VALUES (30, 22, 1)
  INTO OrderDetails VALUES (31, 1, 1)
  INTO OrderDetails VALUES (31, 2, 1)
  INTO OrderDetails VALUES (32, 3, 1)
  INTO OrderDetails VALUES (32, 4, 1)
  INTO OrderDetails VALUES (32, 5, 1)
  INTO OrderDetails VALUES (33, 6, 1)
  INTO OrderDetails VALUES (33, 7, 1)
  INTO OrderDetails VALUES (34, 8, 1)
  INTO OrderDetails VALUES (34, 9, 1)
  INTO OrderDetails VALUES (35, 10, 1)
  INTO OrderDetails VALUES (35, 11, 1)
  INTO OrderDetails VALUES (36, 12, 1)
  INTO OrderDetails VALUES (36, 13, 1)
  INTO OrderDetails VALUES (37, 14, 1)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO OrderDetails VALUES (37, 15, 1)
  INTO OrderDetails VALUES (37, 16, 1)
  INTO OrderDetails VALUES (38, 17, 1)
  INTO OrderDetails VALUES (38, 18, 1)
  INTO OrderDetails VALUES (39, 19, 1)
  INTO OrderDetails VALUES (39, 20, 1)
  INTO OrderDetails VALUES (40, 21, 1)
  INTO OrderDetails VALUES (40, 22, 1)
  INTO OrderDetails VALUES (41, 1, 1)
  INTO OrderDetails VALUES (41, 2, 1)
  INTO OrderDetails VALUES (42, 3, 1)
  INTO OrderDetails VALUES (42, 4, 1)
  INTO OrderDetails VALUES (42, 5, 1)
  INTO OrderDetails VALUES (43, 6, 1)
  INTO OrderDetails VALUES (43, 7, 1)
  INTO OrderDetails VALUES (44, 8, 1)
  INTO OrderDetails VALUES (44, 9, 1)
  INTO OrderDetails VALUES (45, 10, 1)
  INTO OrderDetails VALUES (45, 11, 1)
  INTO OrderDetails VALUES (46, 12, 1)
SELECT * FROM dual;

In [ ]:
INSERT ALL
  INTO OrderDetails VALUES (46, 13, 1)
  INTO OrderDetails VALUES (47, 14, 1)
  INTO OrderDetails VALUES (47, 15, 1)
  INTO OrderDetails VALUES (47, 16, 1)
  INTO OrderDetails VALUES (48, 17, 1)
  INTO OrderDetails VALUES (48, 18, 1)
  INTO OrderDetails VALUES (49, 19, 1)
  INTO OrderDetails VALUES (49, 20, 1)
  INTO OrderDetails VALUES (50, 21, 1)
  INTO OrderDetails VALUES (50, 22, 1)
SELECT * FROM dual;

In [ ]:
SELECT * FROM OrderDetails;

- Product information moved to `Products` table.
- `OrderDetails` references products by `ProductID` instead of repeating names and prices.
- Achieved **3NF**: removed **transitive dependency**.
- Update anomaly fixed: changing product price requires updating only `Products` table.
- Data is now clean, minimal redundancy, and anomaly-free up to 3NF.